[
    {
        "id": 0,
        "name": "Samsung Galaxy M23",
        "category": "samsung",
        "price": 949.00,
        "description":"Najwyższa szybkość dostępna także dla Ciebie! Samsung Galaxy M23 5G jest gotowy, by działać w sieci mobilnej najnowszej generacji. Strumieniowo oglądaj seriale i graj w chmurze bez konieczności ściągania plików na telefon",
        "img": "image/samsung-Galaxy-M23.jpg"
    },
    {
        "id": 1,
        "name": "Apple iPhone 13 mini",
        "category": "iphone",
        "price": 4999.00,
        "description":"Innowacyjny system dwóch aparatów został zaaranżowany na nowo, przesuwając obiektywy o 45 stopni. Dzięki temu nowy szerokokątny obiektyw może robić jeszcze wspanialsze zdjęcia i filmy w warunkach słabego oświetlenia. Ultraszerokokątny obiektyw obejmuje szerszą ramkę, dzięki czemu uchwycisz jeszcze więcej.",
        "img": "image/iPhone-13-Mini.jpg"
    },
    {
        "id": 2,
        "name": "Samsung Galaxy Z Fold",
        "category": "samsung",
        "price": 8399.00,
        "description":"Galaxy Z Fold4 wyróżnia się wyglądem klasy premium. Nie sposób przejść obok niego obojętnie. Złóż go, by intrygować lub rozłóż, by zachwycać. W wersji złożonej jest poręczny i zmieści się w kieszeni, a po otwarciu oferuje duży ekran umożliwiający przeglądanie treści jak na tablecie.",
        "img": "image/samsung-Galaxy-Z-Fold.jpg"
    },
    {
        "id": 3,
        "name": "Huawei Nova Y90",
        "category": "huawei",
        "price": 1099.00,
        "description":"Smartfon HUAWEI nova Y90 to smartfon, w którym technologia przenika się z elegancją. Wyróżnia się układem aparatów inspirowanym kosmicznymi pierścieniami, dając poczucie estetycznej symetrii. 94% jego frontu zajmuje wciągający 6,7-calowy wyświetlacz HUAWEI Edgeless FullView.",
        "img": "image/HUAWEI-Nova-Y90.jpg"
    },
    {
        "id": 4,
        "name": "Apple iPhone 12",
        "category": "iphone",
        "price": 3699.00,
        "description":"A14 Bionic, najszybszy czip znany smartfonom. Wyświetlacz OLED po same krawędzie. I tryb nocny we wszystkich aparatach.",
        "img": "image/iPhone-12.jpg"
    },
    {
        "id": 5,
        "name": "Samsung Galaxy Z Flip",
        "category": "samsung",
        "price": 5149.00,
        "description":"Doświadcz niezwykle wciągających wrażeń na ekranie głównym o przekątnej 6,7 cala*.  Wykonany w technologii Dynamic AMOLED 2X zapewnia kinową jakość obrazu.",
        "img": "image/samsung-Galaxy-Z-FLIP.jpg"
    },
    {
        "id": 6,
        "name": "Xiaomi 11 Lite",
        "category": "xiaomi",
        "price": 1599.00,
        "description":"Procesor Qualcomm Snapdragon 778G w smartfonie XIAOMI LITE 5G NE zapewni Ci niesamowicie szybkie działanie smartfona. Pamięć RAM to 6 GB, a wbudowana pamięć wewnętrzna 128 GB. Przekonaj się o jego możliwościach!",
        "img": "image/XIAOMI-11-Lite.jpg"
    },
    {
        "id": 7,
        "name": "Huawei P50 Pro",
        "category": "huawei",
        "price": 4499.00,
        "description":"Seria HUAWEI P od momentu powstania stanowi idealne połączenie technologii, estetyki i inteligentnej fotografii. Modele z tej serii wyróżnia wyjątkowa dbałość o jakość, styl, a także szczyt innowacji w zakresie fotografii mobilnej.",
        "img": "image/HUAWEI-P50-Pro.jpg"
    },
    {
        "id": 8,
        "name": "Xiaomi Redmi Note 10 Pro",
        "category": "xiaomi",
        "price": 1249.00,
        "description":"Poznaj smartfon Redmi Note 10 Pro i jego wydajne podzespoły, oglądaj filmy na wysokiej jakości ekranie AMOLED i rób zdjęcia jednym z pięciu dostępnych aparatów. W międzyczasie przekonasz się też o długim czasie działania baterii, która z kolei czas ładowania ma wyjątkowo krótki. Do tego kilka przydatnych dodatków jak czytnik linii papilarnych, gniazdo słuchawkowe 3,5 mm, NFC czy nadajnik IR.",
        "img": "image/XIAOMI-Redmi-Note-10.jpg"
    },
    {
        "id": 9,
        "name": "Huawei P50 Pocket",
        "category": "huawei",
        "price": 5427.00,
        "description":"Seria HUAWEI P została zaprojektowana w oparciu o połączenie estetyki technologicznej i inteligentnej fotografii. Ustanawiając nowy standard wzornictwa przemysłowego smartfonów, HUAWEI połączył siły z wybitną projektantką haute couture, Iris Van Herpen, w ramach współpracy międzybranżowej, aby stworzyć HUAWEI P50 Pocket Premium Edition.",
        "img": "image/HUAWEI-P50-Pocket.jpg"
    },
    {
        "id": 10,
        "name": "Apple iPhone 13 Pro",
        "category": "iphone",
        "price": 5649.00,
        "description":"W iPhone 13 Pro Max radykalnie poszerzono możliwości aparatów, zarówno fotograficzne, jak i filmowe. Wyświetlacz oferuje rozdzielczość FHD+, wysoką responsywność i olśniewające kolory. Chip A15 Bionic zapewni niesamowitą szybkość, płynność i jakość grafiki, a jego odporność na wodę i wydajna bateria pozwolą dotrzymać kroku wszędzie, gdzie się udasz.",
        "img": "image/iphon-13-pro.jpg"
    },
    {
        "id": 11,
        "name": "Xiaomi Redmi 9A",
        "category": "xiaomi",
        "price": 489.00,
        "description":"Redmi 9A wyposażono w funkcje, które pozwolą Ci w pełni zanurzyć się w wirtualnym świecie. Uwagę zwraca tutaj między innymi duży 6,53-calowy wyświetlacz. Co więcej, certyfikat ochrony przed niebieskim światłem gwarantuje, że Twoje oczy nie będą zmęczone nawet po długim wpatrywaniu się w ekran.",
        "img": "image/XIAOMI-Redmi-9A.jpg"
    }
]